<?php
/**********************************************************************************
 * ■ショートコード設定ファイル
 **********************************************************************************/
 
//////////////////////////////////////////////////////////////////////////////////
//テンプレートディレクトリを取得するショートコード
//////////////////////////////////////////////////////////////////////////////////
function template_directory_func($atts) {
    $value = get_bloginfo('template_directory');
    return $value;
}
add_shortcode('tmp_dir', 'template_directory_func');

//////////////////////////////////////////////////////////////////////////////////
//サイトURLを取得するショートコード
//////////////////////////////////////////////////////////////////////////////////
function site_url_func($atts) {
    $value = get_bloginfo('url');
    return $value;
}
add_shortcode('site_url', 'site_url_func');

//////////////////////////////////////////////////////////////////////////////////
//phpインクルードするショートコード
//////////////////////////////////////////////////////////////////////////////////
function Include_php($params = array()) {
    extract(shortcode_atts(array(
        'file' => 'default'
    ), $params));
    ob_start();
    include( TEMPLATEPATH . '/include' . "/$file");
    return ob_get_clean();
}  
add_shortcode('myphp', 'Include_php');